## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 15 to add, 1 to change, 45 to destroy
```
**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/security-tools/actions/runs/4566072874).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.cloudquery_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cloudquery_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "CQ_S3_BUCKET"
                          + value = "${CQ_S3_BUCKET}"
                        },
                    ]
                  + essential        = true
                  + image            = "${CLOUDQUERY_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "${CLOUDQUERY_SERVICE_NAME}"
                  + portMappings     = []
                  + secrets          = []
                },
            ]
        )
      + vars     = {
          + "AWS_LOGS_GROUP"          = "/aws/ecs/cloudquery"
          + "AWS_LOGS_REGION"         = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"  = "cloudquery-task"
          + "CLOUDQUERY_IMAGE"        = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cloudquery:latest"
          + "CLOUDQUERY_SERVICE_NAME" = "cloudquery"
          + "CQ_S3_BUCKET"            = "security-tools-794722365809-cloudquery-results"
        }
    }

  # aws_cloudwatch_event_rule.asset_inventory_cartography will be destroyed
  # (because aws_cloudwatch_event_rule.asset_inventory_cartography is not in configuration)
  - resource "aws_cloudwatch_event_rule" "asset_inventory_cartography" {
      - arn                 = "arn:aws:events:ca-central-1:794722365809:rule/cartography" -> null
      - event_bus_name      = "default" -> null
      - id                  = "cartography" -> null
      - is_enabled          = true -> null
      - name                = "cartography" -> null
      - schedule_expression = "cron(0 22 * * ? *)" -> null
      - tags                = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all            = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.asset_inventory_cloudquery will be destroyed
  # (because aws_cloudwatch_event_rule.asset_inventory_cloudquery is not in configuration)
  - resource "aws_cloudwatch_event_rule" "asset_inventory_cloudquery" {
      - arn                 = "arn:aws:events:ca-central-1:794722365809:rule/cloudquery" -> null
      - event_bus_name      = "default" -> null
      - id                  = "cloudquery" -> null
      - is_enabled          = true -> null
      - name                = "cloudquery" -> null
      - schedule_expression = "cron(0 21 * * ? *)" -> null
      - tags                = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all            = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.cloudquery will be created
  + resource "aws_cloudwatch_event_rule" "cloudquery" {
      + arn                 = (known after apply)
      + description         = "CloudQuery ECS Task"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "cloudquery"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 day)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.cloudquery will be created
  + resource "aws_cloudwatch_event_target" "cloudquery" {
      + arn            = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "cloudquery"
      + target_id      = "cloudquery"

      + ecs_target {
          + enable_ecs_managed_tags = false
          + enable_execute_command  = false
          + launch_type             = "FARGATE"
          + propagate_tags          = "TASK_DEFINITION"
          + task_count              = 1
          + task_definition_arn     = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = (known after apply)
              + subnets          = [
                  + "subnet-07f8e17bbf11b0797",
                  + "subnet-08cab5daf34489c53",
                  + "subnet-0d92713028fd15243",
                ]
            }
        }
    }

  # aws_cloudwatch_event_target.sfn_events will be destroyed
  # (because aws_cloudwatch_event_target.sfn_events is not in configuration)
  - resource "aws_cloudwatch_event_target" "sfn_events" {
      - arn            = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography" -> null
      - event_bus_name = "default" -> null
      - id             = "cartography-terraform-20220513152837635900000001" -> null
      - role_arn       = "arn:aws:iam::794722365809:role/secopsAssetInventoryStateMachineRole" -> null
      - rule           = "cartography" -> null
      - target_id      = "terraform-20220513152837635900000001" -> null
    }

  # aws_cloudwatch_log_group.cartography will be destroyed
  # (because aws_cloudwatch_log_group.cartography is not in configuration)
  - resource "aws_cloudwatch_log_group" "cartography" {
      - arn               = "arn:aws:logs:ca-central-1:794722365809:log-group:/aws/ecs/cartography" -> null
      - id                = "/aws/ecs/cartography" -> null
      - name              = "/aws/ecs/cartography" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_log_group.neo4j will be destroyed
  # (because aws_cloudwatch_log_group.neo4j is not in configuration)
  - resource "aws_cloudwatch_log_group" "neo4j" {
      - arn               = "arn:aws:logs:ca-central-1:794722365809:log-group:/aws/ecs/neo4j" -> null
      - id                = "/aws/ecs/neo4j" -> null
      - name              = "/aws/ecs/neo4j" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_log_group.sentinel_neo4j_forwarder will be destroyed
  # (because aws_cloudwatch_log_group.sentinel_neo4j_forwarder is not in configuration)
  - resource "aws_cloudwatch_log_group" "sentinel_neo4j_forwarder" {
      - arn               = "arn:aws:logs:ca-central-1:794722365809:log-group:/aws/ecs/sentinel_neo4j_forwarder" -> null
      - id                = "/aws/ecs/sentinel_neo4j_forwarder" -> null
      - name              = "/aws/ecs/sentinel_neo4j_forwarder" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_ecr_repository.cartography will be destroyed
  # (because aws_ecr_repository.cartography is not in configuration)
  - resource "aws_ecr_repository" "cartography" {
      - arn                  = "arn:aws:ecr:ca-central-1:794722365809:repository/security-tools/cloud_asset_inventory/cartography" -> null
      - id                   = "security-tools/cloud_asset_inventory/cartography" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "security-tools/cloud_asset_inventory/cartography" -> null
      - registry_id          = "794722365809" -> null
      - repository_url       = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cartography" -> null
      - tags                 = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all             = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null

      - encryption_configuration {
          - encryption_type = "KMS" -> null
          - kms_key         = "arn:aws:kms:ca-central-1:794722365809:key/465381ce-855c-4f13-b1d9-427f1ddee696" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }

      - timeouts {}
    }

  # aws_ecr_repository.cloudquery will be updated in-place
  ~ resource "aws_ecr_repository" "cloudquery" {
        id                   = "security-tools/cloud_asset_inventory/cloudquery"
        name                 = "security-tools/cloud_asset_inventory/cloudquery"
      ~ tags                 = {
          ~ "Product"    = "security-tools" -> "security-tools-cloud-asset-inventory"
            # (2 unchanged elements hidden)
        }
      ~ tags_all             = {
          ~ "Product"    = "security-tools" -> "security-tools-cloud-asset-inventory"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.sentinel_neo4j_forwarder will be destroyed
  # (because aws_ecr_repository.sentinel_neo4j_forwarder is not in configuration)
  - resource "aws_ecr_repository" "sentinel_neo4j_forwarder" {
      - arn                  = "arn:aws:ecr:ca-central-1:794722365809:repository/security-tools/cloud_asset_inventory/sentinel_neo4j_forwarder" -> null
      - id                   = "security-tools/cloud_asset_inventory/sentinel_neo4j_forwarder" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "security-tools/cloud_asset_inventory/sentinel_neo4j_forwarder" -> null
      - registry_id          = "794722365809" -> null
      - repository_url       = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/sentinel_neo4j_forwarder" -> null
      - tags                 = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tags_all             = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null

      - encryption_configuration {
          - encryption_type = "KMS" -> null
          - kms_key         = "arn:aws:kms:ca-central-1:794722365809:key/465381ce-855c-4f13-b1d9-427f1ddee696" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecs_service.neo4j will be destroyed
  # (because aws_ecs_service.neo4j is not in configuration)
  - resource "aws_ecs_service" "neo4j" {
      - cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 600 -> null
      - iam_role                           = "aws-service-role" -> null
      - id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/cloud_asset_discovery/neo4j" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "neo4j" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:15" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - alarms {
          - alarm_names = [] -> null
          - enable      = false -> null
          - rollback    = false -> null
        }

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "neo4j" -> null
          - container_port   = 7474 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/neo4j/0f891e215c9b1171" -> null
        }
      - load_balancer {
          - container_name   = "neo4j" -> null
          - container_port   = 7687 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/bolt/43757839223607bf" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-03caf974f268a3efb",
            ] -> null
          - subnets          = [
              - "subnet-07f8e17bbf11b0797",
              - "subnet-08cab5daf34489c53",
              - "subnet-0d92713028fd15243",
            ] -> null
        }

      - service_registries {
          - container_port = 0 -> null
          - port           = 0 -> null
          - registry_arn   = "arn:aws:servicediscovery:ca-central-1:794722365809:service/srv-p2pocy5xnbmjwc6u" -> null
        }
    }

  # aws_ecs_task_definition.cartography will be destroyed
  # (because aws_ecs_task_definition.cartography is not in configuration)
  - resource "aws_ecs_task_definition" "cartography" {
      - arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:10" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AWS_BEST_EFFORT_MODE"
                          - value = "true"
                        },
                      - {
                          - name  = "AWS_CONFIG_FILE"
                          - value = "/config/role_config"
                        },
                      - {
                          - name  = "NEO4J_URI"
                          - value = "bolt://neo4j.internal.local:7687"
                        },
                      - {
                          - name  = "NEO4J_USER"
                          - value = "neo4j"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cartography:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cartography"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cartography-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cartography"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_SECRETS_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "4096" -> null
      - execution_role_arn       = "arn:aws:iam::794722365809:role/cartography_container_execution_role" -> null
      - family                   = "cartography" -> null
      - id                       = "cartography" -> null
      - memory                   = "8192" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 10 -> null
      - skip_destroy             = false -> null
      - tags                     = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole" -> null
    }

  # aws_ecs_task_definition.cloudquery must be replaced
-/+ resource "aws_ecs_task_definition" "cloudquery" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cloudquery:3" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "CQ_S3_BUCKET"
                          - value = "security-tools-794722365809-cloudquery-results"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cloudquery:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cloudquery"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cloudquery-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cloudquery"
                  - portMappings     = []
                  - secrets          = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ execution_role_arn       = "arn:aws:iam::794722365809:role/cartography_container_execution_role" -> (known after apply) # forces replacement
      ~ id                       = "cloudquery" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.neo4j will be destroyed
  # (because aws_ecs_task_definition.neo4j is not in configuration)
  - resource "aws_ecs_task_definition" "neo4j" {
      - arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:15" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "NEO4J_ACCEPT_LICENSE_AGREEMENT"
                          - value = "yes"
                        },
                      - {
                          - name  = "NEO4J_dbms.memory.heap.initial_size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms_memory_heap_max__size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms_memory_pagecache_size"
                          - value = "4G"
                        },
                    ]
                  - essential        = true
                  - image            = "neo4j:4.4.10@sha256:8e3dabe4b3d21c3ffa94dac6750c748b29f93b38d24182c3609ee0cbf293d4cf"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/neo4j"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "neo4j-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/var/lib/neo4j/data"
                          - readOnly      = false
                          - sourceVolume  = "neo4j-efs-volume"
                        },
                    ]
                  - name             = "neo4j"
                  - portMappings     = [
                      - {
                          - containerPort = 7474
                          - hostPort      = 7474
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 7473
                          - hostPort      = 7473
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 7687
                          - hostPort      = 7687
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_AUTH"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 400000
                          - name      = "nofile"
                          - softLimit = 400000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "2048" -> null
      - execution_role_arn       = "arn:aws:iam::794722365809:role/cartography_container_execution_role" -> null
      - family                   = "neo4j" -> null
      - id                       = "neo4j" -> null
      - memory                   = "8192" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 15 -> null
      - skip_destroy             = false -> null
      - tags                     = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole" -> null

      - volume {
          - name = "neo4j-efs-volume" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-00eb8b7a5c27bea14" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null
            }
        }
    }

  # aws_ecs_task_definition.sentinel_neo4j_forwarder will be destroyed
  # (because aws_ecs_task_definition.sentinel_neo4j_forwarder is not in configuration)
  - resource "aws_ecs_task_definition" "sentinel_neo4j_forwarder" {
      - arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:4" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "LOG_TYPE"
                          - value = "Cartography"
                        },
                      - {
                          - name  = "NEO4J_URI"
                          - value = "bolt://neo4j.internal.local:7687"
                        },
                      - {
                          - name  = "NEO4J_USER"
                          - value = "neo4j"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/sentinel_neo4j_forwarder:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sentinel_neo4j_forwarder"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "sentinel_neo4j_forwarder-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "sentinel_neo4j_forwarder"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "NEO4J_SECRETS_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
                        },
                      - {
                          - name      = "CUSTOMER_ID"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/customer_id"
                        },
                      - {
                          - name      = "SHARED_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/shared_key"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "2048" -> null
      - execution_role_arn       = "arn:aws:iam::794722365809:role/cartography_container_execution_role" -> null
      - family                   = "sentinel_neo4j_forwarder" -> null
      - id                       = "sentinel_neo4j_forwarder" -> null
      - memory                   = "4096" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 4 -> null
      - skip_destroy             = false -> null
      - tags                     = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole" -> null
    }

  #...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cloudquery"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.list_accounts_in_org"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
